Revit 2027 API
LabelUtils.GetLabelFor(DuctLossMethodType, Document) Method
 Gets the user-visible name for a DuctLossMethodType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetLabelFor(
	DuctLossMethodType ductLossMethodType,
	Document doc
)
Public Shared Function GetLabelFor (
	ductLossMethodType As DuctLossMethodType,
	doc As Document
) As String
public:
static String^ GetLabelFor(
	DuctLossMethodType ductLossMethodType,
	Document^ doc
)
static member GetLabelFor :
        ductLossMethodType : DuctLossMethodType *
        doc : Document -> string
Parameters
ductLossMethodType DuctLossMethodType
 The DuctLossMethodType to get the user-visible name.
doc Document
 The document from which to get the DuctLossMethodType.
Return Value
String
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when information for the input DuctLossMethodType cannot be found.
Remarks
 The name is obtained in the current Revit language.
See Also
Reference
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace